import React, { FC } from "react";
import { IQuestion } from "../models/iQuestion";

interface PropsType {
  setStape: (arg: number) => void;
  setCorrect: (arg: number) => void;
  correct: number;
  counterQuations: number;
  questions: IQuestion[];
}

export const Result: FC<PropsType> = (props) => {
  const setDefault = () => {
    props.setStape(0);
    props.setCorrect(0);
  };

  return (
    <div className="result">
      {props.correct === 0 && (
        <svg
          width="128px"
          height="128px"
          viewBox="0 0 128 128"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g data-name="Layer 2" id="Layer_2">
            <g id="Export">
              <path d="M64,3A61,61,0,1,1,3,64,61.06,61.06,0,0,1,64,3m0-3a64,64,0,1,0,64,64A64,64,0,0,0,64,0Z" />
              <path d="M85.57,49.28a1.5,1.5,0,0,0-1.5,1.5v9a1.5,1.5,0,0,0,3,0v-9A1.5,1.5,0,0,0,85.57,49.28Z" />
              <path d="M42.43,49.28a1.5,1.5,0,0,0-1.5,1.5v9a1.5,1.5,0,0,0,3,0v-9A1.5,1.5,0,0,0,42.43,49.28Z" />
              <path d="M87.11,92.08a41,41,0,0,0-26-7.22,40.13,40.13,0,0,0-9.48,1.88,18,18,0,0,0-2.72-7.8C47,76,44.67,74.33,42.43,74.33S37.84,76,36,78.94c-2.2,3.42-4,9.11-1.79,13.9,1.38,3,4.47,6,8.26,6s6.89-3,8.27-6a11,11,0,0,0,.86-2.92,36.88,36.88,0,0,1,9.76-2.07,37.94,37.94,0,0,1,24.09,6.7,1.51,1.51,0,0,0,2.08-.38A1.49,1.49,0,0,0,87.11,92.08ZM48,91.59c-.68,1.49-2.71,4.3-5.54,4.3s-4.85-2.81-5.53-4.3c-1.58-3.45-.34-8,1.58-11,1.27-2,2.82-3.23,4-3.23s2.69,1.27,4,3.23C48.31,83.56,49.55,88.14,48,91.59Z" />
            </g>
          </g>
        </svg>
      )}
      {props.correct === 1 && (
        <svg
          width="128px"
          height="128px"
          viewBox="0 0 128 128"
          xmlns="http://www.w3.org/2000/svg"
        >
          <g data-name="Layer 2" id="Layer_2">
            <g id="Export">
              <path d="M64,3A61,61,0,1,1,3,64,61.06,61.06,0,0,1,64,3m0-3a64,64,0,1,0,64,64A64,64,0,0,0,64,0Z" />
              <path d="M86.26,94.81a1.47,1.47,0,0,1-.85-.26,38,38,0,0,0-24.09-6.7A37.48,37.48,0,0,0,42.6,94.54a1.5,1.5,0,1,1-1.72-2.46,40.5,40.5,0,0,1,20.23-7.22,41,41,0,0,1,26,7.22,1.5,1.5,0,0,1-.85,2.73Z" />
              <path d="M43.83,60.63a9.34,9.34,0,0,1-8.28-5,1.5,1.5,0,1,1,2.64-1.41,6.39,6.39,0,0,0,11.27,0,1.5,1.5,0,1,1,2.65,1.41A9.37,9.37,0,0,1,43.83,60.63Z" />
              <path d="M85.57,60.63a9.34,9.34,0,0,1-8.28-5,1.5,1.5,0,1,1,2.64-1.41,6.39,6.39,0,0,0,11.27,0,1.5,1.5,0,1,1,2.64,1.41A9.34,9.34,0,0,1,85.57,60.63Z" />
            </g>
          </g>
        </svg>
      )}
      {props.correct > 1 && (
        <svg
          width="128px"
          height="128px"
          viewBox="0 0 128 128"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path d="M64,3A61,61,0,1,1,3,64,61.06,61.06,0,0,1,64,3m0-3a64,64,0,1,0,64,64A64,64,0,0,0,64,0Z" />
          <path d="M64,94.81c-.93,0-1.87,0-2.84-.1a40.4,40.4,0,0,1-20.23-7.22A1.5,1.5,0,1,1,42.6,85a37.39,37.39,0,0,0,18.72,6.69A37.93,37.93,0,0,0,85.41,85a1.5,1.5,0,0,1,2.08.38,1.48,1.48,0,0,1-.38,2.08A41.09,41.09,0,0,1,64,94.81Z" />
          <path d="M36.87,60.63a1.53,1.53,0,0,1-.71-.18,1.5,1.5,0,0,1-.61-2,9.39,9.39,0,0,1,16.56,0,1.5,1.5,0,0,1-2.65,1.42,6.39,6.39,0,0,0-11.27,0A1.51,1.51,0,0,1,36.87,60.63Z" />
          <path d="M92.52,60.63a1.51,1.51,0,0,1-1.32-.79,6.39,6.39,0,0,0-11.27,0,1.5,1.5,0,1,1-2.64-1.42,9.38,9.38,0,0,1,16.55,0,1.5,1.5,0,0,1-.61,2A1.53,1.53,0,0,1,92.52,60.63Z" />
        </svg>
      )}
      <div>
        {props.correct === 0 && (
          <h2 className="result__title">
            Вы не отгадали ни одного ответа из {props.counterQuations}
          </h2>
        )}
        {props.correct === 1 && (
          <h2 className="result__title">
            Вы правильно ответили всего на {props.correct} ответ из{" "}
            {props.counterQuations}
          </h2>
        )}
        {props.correct > 1 && (
          <h2 className="result__title">
            Вы правильно отгадали {props.correct} ответа из{" "}
            {props.counterQuations}
          </h2>
        )}
      </div>
      <div className="result__items">
        {props.questions.map((item, i) => (
          <div className="result__item" key={i}>
            <span>{i + 1}</span>
            <h5 className="result__item-text">{item.title}:</h5>
            <p className="result__item-text">{item.variants[item.correct]}</p>
          </div>
        ))}
      </div>
      <button onClick={() => setDefault()}>Попробовать снова</button>
    </div>
  );
};
